src/cf/Catalogs/ШаблоныНаименований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныНаименований</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНаименования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаименованийОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекурсивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляПредставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляФормирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ТоварВнеБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ор_ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ор_РеквизитыДляЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ШаблоныНаименований/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Настройки = Новый Структура;
	Настройки.Вставить("БулевскиеПараметры", Новый Массив);
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		Объект.Владелец = Справочники.КатегорииНоменклатуры.БезКатегории;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда
		Параметры.Свойство("КатегорияНоменклатуры", Объект.КатегорияНоменклатуры);
		Если ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда
			Объект.Владелец = Объект.КатегорияНоменклатуры;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = ШаблоныНаименований.НаименованиеНезаполненногоШаблона();
	КонецЕсли;
	
	Если Параметры.Свойство("ДляХарактеристики") Тогда
		Объект.ДляХарактеристики = Параметры.ДляХарактеристики;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидНаименования) Тогда
		Параметры.Свойство("ВидНаименования", Объект.ВидНаименования);
	КонецЕсли;
	
	Если Параметры.Свойство("НоменклатураВнеБазы") Тогда
		Объект.ор_ТоварВнеБазы = Истина;
	КонецЕсли;
	
	// Временная заглушка.
	// Типовой функционал не всегда заполняет Вид наименования.
	Если НЕ ЗначениеЗаполнено(Объект.ВидНаименования) И ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда
		Объект.ВидНаименования = ?(
			Объект.ДляХарактеристики,
			Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее,
			Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее
		);
	КонецЕсли;
	
	Если Объект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента Тогда
		НаборСвойств = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_ДоговорыКонтрагентов");
	ИначеЕсли Объект.ДляХарактеристики Тогда
		НаборСвойств = Объект.КатегорияНоменклатуры.НаборСвойствХарактеристики;
	Иначе
		НаборСвойств = Объект.КатегорияНоменклатуры.НаборСвойств;
	КонецЕсли;
	
	ПодготовитьДопТаблицыТоваровВнеБазы();
	
	СоздатьКомандыДобавленияСвойств();
	ОбновитьПримерНаСервере();
	
	ПозицияКурсора = Новый Структура("НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки", 0, 0, 0, 0);
	
	УстановнитьВидимостьРеквизитовПравила();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ЭтоПредопределенный Тогда
		ТекущийОбъект.ЭтоПредопределенный = (ТекущийОбъект.ШаблонДляПредставления = ШаблонПриОткрытии);
	КонецЕсли;
	
	ШаблоныНаименований.СформироватьНаименованиеШаблона(ТекущийОбъект);
	ОбновитьШаблонДляФормирования(Реквизиты, ТекущийОбъект.ШаблонДляПредставления, ТекущийОбъект.ШаблонДляФормирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ШаблоныНаименований");
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонДляПредставленияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("ОбновитьОтображениеФормы", 1.5, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура Подключаемый_КомандаВставитьПараметр(Команда)
	
	ПараметрИдентификатор = ПараметрИдентификатор(Команда.Имя);
	
	ДобавитьБлокВШаблон(, ПараметрИдентификатор);
	ПодключитьОбработчикОжидания("ОбновитьОтображениеФормы", 0.1, Истина);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКомандыДобавленияСвойств()
	
	// ИдентификаторПолный        - Внутреннее представление идентификатора для определения доп. реквизита.
	// ИдентификаторПредставление - Внешнее представление идентификатора для подстановки в шаблон (при записи заменяется на внутренний).
	// Представление              - Представление добавляемого параметра (используется в кнопках командной панели).
	// Заголовок                  - Заголовок сопутствующий параметру (добавляется в виде свободного текста перед значением параметра).
	
	НоваяСтрока = Реквизиты.Добавить();
	НоваяСтрока.ИдентификаторПолный = "Наименование";
	НоваяСтрока.ИдентификаторПредставление = "Наименование";
	НоваяСтрока.Представление = НСтр("ru='Наименование'");
	НоваяСтрока.Заголовок     = "";
	
	ШаблоныНаименованийСписокСвойств.Добавить("Наименование", НСтр("ru = 'Наименование'"));
	
	НоваяСтрока = Реквизиты.Добавить();
	НоваяСтрока.ИдентификаторПолный = "Артикул";
	НоваяСтрока.ИдентификаторПредставление = "Артикул";
	НоваяСтрока.Представление = НСтр("ru='Артикул'");
	НоваяСтрока.Заголовок     = "";
	
	ШаблоныНаименованийСписокСвойств.Добавить("Артикул", НСтр("ru = 'Артикул'"));
	
	Если Объект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента Тогда
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Код";
		НоваяСтрока.ИдентификаторПредставление = "Код";
		НоваяСтрока.Представление = НСтр("ru='Код'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "НомерДоговора";
		НоваяСтрока.ИдентификаторПредставление = "НомерДоговора";
		НоваяСтрока.Представление = НСтр("ru='Номер договора'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ДатаНачала";
		НоваяСтрока.ИдентификаторПредставление = "ДатаНачала";
		НоваяСтрока.Представление = НСтр("ru='Дата начала (ДД.ММ.ГГГГ)'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ДатаОкончания";
		НоваяСтрока.ИдентификаторПредставление = "ДатаОкончания";
		НоваяСтрока.Представление = НСтр("ru='Дата окончания (ДД.ММ.ГГГГ)'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ДатаНачалаСокр";
		НоваяСтрока.ИдентификаторПредставление = "ДатаНачалаСокр";
		НоваяСтрока.Представление = НСтр("ru='Дата начала (ДД.ММ.ГГ)'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ДатаОкончанияСокр";
		НоваяСтрока.ИдентификаторПредставление = "ДатаОкончанияСокр";
		НоваяСтрока.Представление = НСтр("ru='Дата окончания  (ДД.ММ.ГГ)'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Организация";
		НоваяСтрока.ИдентификаторПредставление = "Организация";
		НоваяСтрока.Представление = НСтр("ru='Организация'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Валюта";
		НоваяСтрока.ИдентификаторПредставление = "Валюта";
		НоваяСтрока.Представление = НСтр("ru='Валюта'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ВидДоговора";
		НоваяСтрока.ИдентификаторПредставление = "ВидДоговора";
		НоваяСтрока.Представление = НСтр("ru='Вид договора'");
		НоваяСтрока.Заголовок     = "";
		
		ШаблоныНаименованийСписокСвойств.Добавить("Код", НСтр("ru = 'ФР-01'"));
		ШаблоныНаименованийСписокСвойств.Добавить("НомерДоговора", НСтр("ru = 'НФ-0002'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ДатаНачала", "01.10.2014");
		ШаблоныНаименованийСписокСвойств.Добавить("СрокДействия", "19.10.2030");
		ШаблоныНаименованийСписокСвойств.Добавить("Владелец", НСтр("ru = '""Наша фирма""'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ВалютаРасчетов", "RUB");
		ШаблоныНаименованийСписокСвойств.Добавить("ВидДоговора", НСтр("ru = 'с поставщиком'"));
		
	ИначеЕсли НЕ Объект.ДляХарактеристики Тогда
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Код";
		НоваяСтрока.ИдентификаторПредставление = "Код";
		НоваяСтрока.Представление = НСтр("ru='Код'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "СтранаПроисхождения";
		НоваяСтрока.ИдентификаторПредставление = "СтранаПроисхождения";
		НоваяСтрока.Представление = НСтр("ru='Страна происхождения'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'Страна происхождения'");
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Поставщик";
		НоваяСтрока.ИдентификаторПредставление = "Поставщик";
		НоваяСтрока.Представление = НСтр("ru='Поставщик'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'Поставщик'");
		
		ШаблоныНаименованийСписокСвойств.Добавить("Артикул", "1234");
		ШаблоныНаименованийСписокСвойств.Добавить("Код", НСтр("ru = 'ФР-01'"));
		ШаблоныНаименованийСписокСвойств.Добавить("СтранаПроисхождения", НСтр("ru = 'Россия'"));
		ШаблоныНаименованийСписокСвойств.Добавить("Поставщик", НСтр("ru = 'ООО ""Наталья""'"));
		
		// + ор
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_Производитель";
		НоваяСтрока.ИдентификаторПредставление = "ор_Производитель";
		НоваяСтрока.Представление = НСтр("ru='Производитель'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_ЕГК";
		НоваяСтрока.ИдентификаторПредставление = "ор_ЕГК";
		НоваяСтрока.Представление = НСтр("ru='Единый государственный классификатор лекарственных средств'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'ЕГК'");
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_Дозировка";
		НоваяСтрока.ИдентификаторПредставление = "ор_Дозировка";
		НоваяСтрока.Представление = НСтр("ru='Дозировка'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'Дозировка'");
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_КодРосздравнадзора";
		НоваяСтрока.ИдентификаторПредставление = "ор_КодРосздравнадзора";
		НоваяСтрока.Представление = НСтр("ru='Код Росздравнадзора'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'Код Росздравнадзора'");
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_МНН";
		НоваяСтрока.ИдентификаторПредставление = "ор_МНН";
		НоваяСтрока.Представление = НСтр("ru='Международное непатентованное наименование'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'МНН'");
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_ФТГ";
		НоваяСтрока.ИдентификаторПредставление = "ор_ФТГ";
		НоваяСтрока.Представление = НСтр("ru='Фармако-терапевтическая группа'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'ФТГ'");
		
		ШаблоныНаименованийСписокСвойств.Добавить("ор_Производитель", НСтр("ru = 'Лекарственный Производитель'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ор_Дозировка", НСтр("ru = '9 мг/мл'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ор_ЕГК", НСтр("ru = '024250N000'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ор_КодРосздравнадзора", НСтр("ru = '137090'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ор_МНН", НСтр("ru = 'Даролутамид'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ор_ФТГ", НСтр("ru = 'Антиандрогены'"));
		
	Иначе
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_Производитель";
		НоваяСтрока.ИдентификаторПредставление = "ор_Производитель";
		НоваяСтрока.Представление = НСтр("ru='Производитель'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_СерияПроизводителя";
		НоваяСтрока.ИдентификаторПредставление = "ор_СерияПроизводителя";
		НоваяСтрока.Представление = НСтр("ru='Серия производителя'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_ДатаИзготовления";
		НоваяСтрока.ИдентификаторПредставление = "ор_ДатаИзготовления";
		НоваяСтрока.Представление = НСтр("ru='Дата изготовления'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'Дата изготовления'");
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_СрокГодности";
		НоваяСтрока.ИдентификаторПредставление = "ор_СрокГодности";
		НоваяСтрока.Представление = НСтр("ru='Срок годности'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'Срок годности'");
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_СтранаПроисхождения";
		НоваяСтрока.ИдентификаторПредставление = "ор_СтранаПроисхождения";
		НоваяСтрока.Представление = НСтр("ru='Страна происхождения'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'Страна происхождения'");
		
		ШаблоныНаименованийСписокСвойств.Добавить("ор_Производитель", НСтр("ru = 'Лекарственный Производитель'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ор_СерияПроизводителя", НСтр("ru = '250418'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ор_ДатаИзготовления", НСтр("ru = '01.10.2021'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ор_СрокГодности", НСтр("ru = '01.10.2024'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ор_СтранаПроисхождения", НСтр("ru = 'Россия'"));
		
		// - ор
	КонецЕсли;
	
	Если Объект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее
		Или Объект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее Тогда
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ор_НаименованиеПоставщика";
		НоваяСтрока.ИдентификаторПредставление = "ор_НаименованиеПоставщика";
		НоваяСтрока.Представление = НСтр("ru='Наименование поставщика'");
		НоваяСтрока.Заголовок     = "";
		
		ШаблоныНаименованийСписокСвойств.Добавить("ор_НаименованиеПоставщика", НСтр("ru = 'ООО ""Производитель""'"));
		
	КонецЕсли;
	
	Для каждого ДопРеквизит Из НаборСвойств.ДополнительныеРеквизиты Цикл
		
		Если ДопРеквизит.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоБулевскийРеквизит = ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Булево"));
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = ДопРеквизит.Свойство;
		НоваяСтрока.ИдентификаторПредставление = ДопРеквизит.Свойство.Заголовок;
		НоваяСтрока.Представление = ДопРеквизит.Свойство.Заголовок;
		НоваяСтрока.Заголовок     = ?(ЭтоБулевскийРеквизит, "", ДопРеквизит.Свойство.Заголовок);
		
		Если ЭтоБулевскийРеквизит Тогда
			Настройки.БулевскиеПараметры.Добавить("[" + НоваяСтрока.ИдентификаторПолный + "]");
		КонецЕсли;
		
		Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
			Значения = Справочники.ЗначенияСвойствОбъектов.Выбрать(, ДопРеквизит.Свойство);
			Значения.Следующий();
			Значение = Значения;
		ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Число")) Тогда
			ГСЧ = Новый ГенераторСлучайныхЧисел;
			Значение = ГСЧ.СлучайноеЧисло(1, 30);
		ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Строка")) Тогда
			Значение = "<значение>";
		ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Булево")) Тогда
			Значение = ДопРеквизит.Свойство.Заголовок;
		ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Дата")) Тогда
			Значение = ТекущаяДатаСеанса();
		Иначе
			Значение = ДопРеквизит.Свойство.Заголовок;
		КонецЕсли;
		ШаблоныНаименованийСписокСвойств.Добавить(Строка(ДопРеквизит.Свойство), Значение);
		
	КонецЦикла;
	
	Реквизиты.Сортировать("Представление");
	
	СоздатьКомандыДобавленияПараметров();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКомандыДобавленияПараметров()
	
	Для Итератор = 0 По Реквизиты.Количество() - 1 Цикл
		
		Реквизит = Реквизиты[Итератор];
		
		НоваяКоманда = Команды.Добавить("КомандаВставитьПараметр" + Итератор);
		НоваяКоманда.Действие = "Подключаемый_КомандаВставитьПараметр";
		НоваяКоманда.Заголовок = Реквизиты[Итератор].Представление;
		
		НоваяКнопка = Элементы.Добавить("КомандаВставитьПараметр" + Итератор, Тип("КнопкаФормы"), Элементы.ГруппаДобавитьПараметр);
		НоваяКнопка.ИмяКоманды = "КомандаВставитьПараметр" + Итератор;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрИдентификатор(КомандаИмя)
	
	Возврат Число(СтрЗаменить(КомандаИмя, "КомандаВставитьПараметр", ""));
	
КонецФункции

&НаКлиенте
Процедура ДобавитьБлокВШаблон(БлокТекст = Неопределено, ПараметрИдентификатор = Неопределено)
	
	Если ПараметрИдентификатор <> Неопределено Тогда
		Параметр = "[" + Реквизиты[ПараметрИдентификатор].ИдентификаторПредставление + "]";
	Иначе
		Параметр = "";
	КонецЕсли;
	
	Если БлокТекст <> Неопределено Тогда
		Текст = "" + БлокТекст + " ";
		ПредопределенныйРазделитель = "";
	ИначеЕсли ПараметрИдентификатор <> Неопределено Тогда
		Текст = "" + Реквизиты[ПараметрИдентификатор].Заголовок;
		Если ЗначениеЗаполнено(Текст) Тогда
			Текст = Текст + " ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ШаблонДляПредставления) Тогда
			ПредопределенныйРазделитель = ", ";
		Иначе
			ПредопределенныйРазделитель = "";
		КонецЕсли;
	Иначе
		Текст = "";
		ПредопределенныйРазделитель = ", ";
	КонецЕсли;
	
	ТекстДляВставки = "{%1%2%3}";
	ТекстДляВставки = СтрШаблон(ТекстДляВставки, ПредопределенныйРазделитель, Текст, Параметр);
	
	СтрокаНач = 0;
	СтрокаКон = 0;
	КолонкаНач = 0;
	КолонкаКон = 0;
	Элементы.ШаблонДляПредставления.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	
	ПозицияНачалаВставки = ОпределитьПозициюВставкиТекста(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	ПозицияКонцаВставки = ПозицияНачалаВставки + СтрДлина(ТекстДляВставки);
	
	ПозицияКурсора.НачалоСтроки = СтрокаНач;
	ПозицияКурсора.НачалоКолонки = ПозицияКонцаВставки;
	ПозицияКурсора.КонецСтроки = СтрокаКон;
	ПозицияКурсора.КонецКолонки = ПозицияКонцаВставки;
	
	Текст = Объект.ШаблонДляПредставления;
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Объект.ШаблонДляПредставления = ТекстДляВставки;
	Иначе
		Объект.ШаблонДляПредставления = Лев(Текст, ПозицияНачалаВставки - 1) + ТекстДляВставки + Прав(Текст, СтрДлина(Текст) - ПозицияНачалаВставки + 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьПозициюВставкиТекста(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон)
	
	ТекущаяПозицияВСтроке = КолонкаНач;
	
	Если (ТекущаяПозицияВСтроке = СтрДлина(Объект.ШаблонДляПредставления) + 1) Тогда
		Возврат ТекущаяПозицияВСтроке;
	КонецЕсли;
	
	НачалоБлокаСлева = 0;
	КонецБлокаСлева = 0;
	Если ТекущаяПозицияВСтроке > 1 Тогда
		НачалоБлокаСлева = СтрНайти(Объект.ШаблонДляПредставления, "{", НаправлениеПоиска.СКонца, ТекущаяПозицияВСтроке - 1);
		КонецБлокаСлева = СтрНайти(Объект.ШаблонДляПредставления, "}", НаправлениеПоиска.СКонца, ТекущаяПозицияВСтроке - 1);
	КонецЕсли;
	
	НачалоБлокаСправа = СтрНайти(Объект.ШаблонДляПредставления, "{", НаправлениеПоиска.СНачала, ТекущаяПозицияВСтроке);
	КонецБлокаСправа = СтрНайти(Объект.ШаблонДляПредставления, "}", НаправлениеПоиска.СНачала, ТекущаяПозицияВСтроке);
	
	КурсорВБлоке = 
		ТекущаяПозицияВСтроке = НачалоБлокаСлева
		ИЛИ ТекущаяПозицияВСтроке = КонецБлокаСправа
		ИЛИ (
			НачалоБлокаСлева > КонецБлокаСлева 
			И ( 
				(НачалоБлокаСправа = 0 И КонецБлокаСправа <> 0) 
				ИЛИ КонецБлокаСправа < НачалоБлокаСправа));
	
	Если НЕ КурсорВБлоке Тогда
		Возврат ТекущаяПозицияВСтроке;
	КонецЕсли;
	
	ТекущаяПозицияВСтроке = КонецБлокаСправа + 1;
	Возврат ТекущаяПозицияВСтроке;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьШаблонДляФормирования(Реквизиты, ШаблонДляПредставления, ШаблонДляФормирования)
	
	ШаблонДляФормирования = ШаблонДляПредставления;
	
	Для каждого Реквизит Из Реквизиты Цикл
		
		ШаблонДляФормирования = СтрЗаменить(ШаблонДляФормирования, "[" + Реквизит.ИдентификаторПредставление + "]", "[" + Реквизит.ИдентификаторПолный + "]");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеФормы() Экспорт
	
	ОбновитьПример(Истина);
	УстановитьКурсорВПолеШаблона();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПример(ПолучитьПозициюКурсора = Ложь)
	
	Если ПолучитьПозициюКурсора Тогда
		Элементы.ШаблонДляПредставления.ПолучитьГраницыВыделения(
			ПозицияКурсора.НачалоСтроки,
			ПозицияКурсора.НачалоКолонки,
			ПозицияКурсора.КонецСтроки,
			ПозицияКурсора.КонецКолонки);
	Иначе
		ПозицияКурсора.НачалоСтроки = 0;
		ПозицияКурсора.НачалоКолонки = 0;
		ПозицияКурсора.КонецСтроки = 0;
		ПозицияКурсора.КонецКолонки = 0;
	КонецЕсли;
	
	Объект.ШаблонДляПредставления = Элементы.ШаблонДляПредставления.ТекстРедактирования;
	ОбновитьШаблонДляФормирования(Реквизиты, Элементы.ШаблонДляПредставления.ТекстРедактирования, Объект.ШаблонДляФормирования);
	НаименованиеПример = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(ШаблоныНаименованийСписокСвойств, Объект.ШаблонДляФормирования);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПримерНаСервере()
	
	НаименованиеПример = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(ШаблоныНаименованийСписокСвойств, Объект.ШаблонДляФормирования);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКурсорВПолеШаблона()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.НаименованиеПример;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШаблонДляПредставления;
	
	Если ЗначениеЗаполнено(Объект.ШаблонДляПредставления)
		И ПозицияКурсора.НачалоСтроки <> 0
		И ПозицияКурсора.НачалоКолонки  <> 0
		И ПозицияКурсора.КонецСтроки <> 0
		И ПозицияКурсора.КонецКолонки <> 0 Тогда
		Элементы.ШаблонДляПредставления.УстановитьГраницыВыделения(
			ПозицияКурсора.НачалоСтроки,
			ПозицияКурсора.НачалоКолонки,
			ПозицияКурсора.КонецСтроки,
			ПозицияКурсора.КонецКолонки);
	КонецЕсли;
	
КонецПроцедуры

#Область ОтраслевыеПроцедурыИФункции

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ор_ТоварВнеБазыПриИзменении(Элемент)
	
	Если Объект.ор_ДополнительныеРеквизиты.Количество() > 0 ИЛИ Объект.ор_РеквизитыДляЗаполнения.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ИзменениеТовараВнеБазыЗавершение", ЭтотОбъект, Объект.ор_ТоварВнеБазы);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Список реквизитов и доп. реквизитов будет очищен, продолжить?'"),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет);
	Иначе
		УстановнитьВидимостьРеквизитовПравила();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДопРеквизитов

&НаКлиенте
Процедура Подключаемый_ДополнительныеРеквизитыПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Представление", ВыбранноеЗначение);
	Если Объект.ор_ДополнительныеРеквизиты.НайтиСтроки(СтруктураОтбора).Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(СтрШаблон("ru = 'Реквизит %1 уже добавлен.'", ВыбранноеЗначение)));
		Возврат;
	КонецЕсли;
	
	ПараметрыСтроки = ПолучитьПараметрыСтрокиДопРеквизита(ВыбранноеЗначение);
	ОписаниеТипа = Новый ОписаниеТипов(ПараметрыСтроки.Тип);
	
	СтрокаДанных = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;
	СтрокаДанных.Представление = ВыбранноеЗначение;
	СтрокаДанных.Реквизит      = ПараметрыСтроки.Реквизит;
	СтрокаДанных.Значение      = ОписаниеТипа.ПривестиЗначение(ВыбранноеЗначение);
	Если ТипЗнч(СтрокаДанных.Значение) = Тип("Строка") Тогда
		СтрокаДанных.Значение = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаРеквизитов

&НаКлиенте
Процедура Подключаемый_РеквизитыДляЗаполненияПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Представление", ВыбранноеЗначение);
	Если Объект.ор_РеквизитыДляЗаполнения.НайтиСтроки(СтруктураОтбора).Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(СтрШаблон("ru = 'Реквизит %1 уже добавлен.'", ВыбранноеЗначение)));
		Возврат;
	КонецЕсли;
	
	ПараметрыСтроки = ПолучитьПараметрыСтрокиРеквизита(ВыбранноеЗначение);
	ОписаниеТипа = Новый ОписаниеТипов(ПараметрыСтроки.Тип);
	
	СтрокаДанных = Элементы.РеквизитыДляЗаполнения.ТекущиеДанные;
	СтрокаДанных.Представление = ВыбранноеЗначение;
	СтрокаДанных.Реквизит      = ПараметрыСтроки.Реквизит;
	СтрокаДанных.Значение      = ОписаниеТипа.ПривестиЗначение(ОписаниеТипа); 
	Если ТипЗнч(СтрокаДанных.Значение) = Тип("Строка") Тогда
		СтрокаДанных.Значение = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РеквизитыДляЗаполненияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	
	Для Каждого ТекЭлемент Из ЭтотОбъект.СписокРеквизитовФормы Цикл
		Элемент.СписокВыбора.Добавить(ТекЭлемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РеквизитыДляЗаполненияПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "РеквизитыДляЗаполненияЗначение" Тогда
		МассивТипов = Новый Массив();
		МассивТипов.Добавить(ТипЗнч(Элемент.ТекущиеДанные.Значение));
		Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРеквизитыПоУмолчанию(Команда)
	
	ТолькоОбязательные = Ложь;
	
	Если Объект.ор_РеквизитыДляЗаполнения.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьРеквизитыПоУмолчаниюЗавершение", ЭтотОбъект, ТолькоОбязательные);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Очистить список реквизитов перед заполнением?'"),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет,
			НСтр("ru = 'Очистка таблицы'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыПоУмолчаниюНаСервере(ТолькоОбязательные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьОбязательныеРеквизиты(Команда)
	
	ТолькоОбязательные = Истина;
	Если Объект.ор_РеквизитыДляЗаполнения.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьРеквизитыПоУмолчаниюЗавершение", ЭтотОбъект, ТолькоОбязательные);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Очистить список реквизитов перед заполненим?'"),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет,
			НСтр("ru = 'Очистка таблицы'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыПоУмолчаниюНаСервере(ТолькоОбязательные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьДополнительныеРеквизиты(Команда)
	
	ТолькоОбязательные = Ложь;
	
	Если Объект.ор_ДополнительныеРеквизиты.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДополнительныеРеквизитыПоУмолчаниюЗавершение", ЭтотОбъект, ТолькоОбязательные);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Очистить список реквизитов перед заполненим?'"),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет,
			НСтр("ru = 'Очистка таблицы'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДополнительныеРеквизитыНаСервере(ТолькоОбязательные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьОбязательныеДополнительныеРеквизиты(Команда)
	
	ТолькоОбязательные = Истина;
	Если Объект.ор_ДополнительныеРеквизиты.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДополнительныеРеквизитыПоУмолчаниюЗавершение", ЭтотОбъект, ТолькоОбязательные);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Очистить список реквизитов перед заполненим?'"),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет,
			НСтр("ru = 'Очистка таблицы'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДополнительныеРеквизитыНаСервере(ТолькоОбязательные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановнитьВидимостьРеквизитовПравила()
	
	Если Объект.ВидНаименования <> ПредопределенноеЗначение("Перечисление.ВидыНаименованийОбъектов.НоменклатураРабочее")
		И Объект.ВидНаименования <> ПредопределенноеЗначение("Перечисление.ВидыНаименованийОбъектов.ХарактеристикаРабочее") Тогда
		Объект.ор_ТоварВнеБазы = Ложь;
		Элементы.ор_ТоварВнеБазы.Видимость = Ложь;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИдентификаторПолный", "ор_НаименованиеПоставщика");
	НайденныеСтроки = Реквизиты.НайтиСтроки(СтруктураОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		НайденныйЭлемент = Элементы.Найти("КомандаВставитьПараметр" + Реквизиты.Индекс(НайденныеСтроки[0]));
		Если НайденныйЭлемент <> Неопределено Тогда
			НайденныйЭлемент.Доступность = Объект.ор_ТоварВнеБазы;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Объект.ор_ТоварВнеБазы Тогда
		ИмяПараметра = "[ор_НаименованиеПоставщика]";
		УдалитьПараметрИзШаблона(Объект.ШаблонДляПредставления, ИмяПараметра);
		УдалитьПараметрИзШаблона(Объект.ШаблонДляФормирования, ИмяПараметра);
	КонецЕсли;
	
	Элементы.СтраницыРеквизитов.Видимость = Объект.ор_ТоварВнеБазы;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПараметрИзШаблона(РедактируемыйШаблон, ИмяПараметра)
	
	НомерПозиции = СтрНайти(РедактируемыйШаблон, ИмяПараметра);
	Если НомерПозиции = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НомерПервогоСимвола = СтрНайти(РедактируемыйШаблон, "{", НаправлениеПоиска.СКонца, НомерПозиции);
	НомерПоследнегоСимвола = СтрНайти(РедактируемыйШаблон, "}", НаправлениеПоиска.СНачала, НомерПозиции);
	
	РедактируемыйШаблон = Лев(РедактируемыйШаблон, НомерПервогоСимвола - 1) + Сред(РедактируемыйШаблон, НомерПоследнегоСимвола + 1);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДопТаблицыТоваровВнеБазы()
	
	Если Объект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента Тогда
		Возврат;
	КонецЕсли;
	
	НачальныеПараметры = ШаблоныНаименований.СформироватьНачальныеПараметрыПоПравилу(Объект.ВидНаименования);
	
	СформироватьСписокИсключающихРеквизитов();
	
	ЭтотОбъект.ТаблицаРеквизитов.Загрузить(СформироватьТаблицуРеквизитов(НачальныеПараметры));
	
	СформироватьСписокРеквизитов(НачальныеПараметры);
	СформироватьТаблицуДопРеквизитов(НачальныеПараметры);
	
	Элементы.ДополнительныеРеквизитыПредставление.СписокВыбора.Очистить();
	Для Каждого ТекЭлемент Из ЭтотОбъект.СписокДопРеквизитов Цикл
		Элементы.ДополнительныеРеквизитыПредставление.СписокВыбора.Добавить(ТекЭлемент.Значение);
	КонецЦикла;
	
	Элементы.ДополнительныеРеквизитыПредставление.КнопкаВыпадающегоСписка = Истина;
	Элементы.РеквизитыДляЗаполненияПредставление.КнопкаВыпадающегоСписка  = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоУмолчаниюНаСервере(ТолькоОбязательные = Ложь)
	
	НачальныеПараметры = ШаблоныНаименований.СформироватьНачальныеПараметрыПоПравилу(Объект.ВидНаименования);
	
	Для Каждого Реквизит Из НачальныеПараметры.НаборРеквизитов Цикл
		Если НЕ ТолькоОбязательные
			ИЛИ Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			
			Если НЕ ШаблоныНаименований.ОтраслевойРеквизитИспользуется(Реквизит.Имя, Объект.ВидНаименования) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ШаблоныНаименований.РеквизитИспользуется(Реквизит.Имя, Ложь) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭтотОбъект.ИсключающиеРеквизиты.НайтиПоЗначению(Реквизит.Синоним) = Неопределено Тогда
				НоваяСтрока = Объект.ор_РеквизитыДляЗаполнения.Добавить();
				НоваяСтрока.Реквизит      = Реквизит.Имя;
				НоваяСтрока.Представление = Реквизит.Синоним;
				ОписаниеТипа = Новый ОписаниеТипов(Реквизит.Тип);
				НоваяСтрока.Значение = ОписаниеТипа.ПривестиЗначение();
				Если ТипЗнч(НоваяСтрока.Значение) = Тип("Строка") Тогда
					НоваяСтрока.Значение = "";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыНаСервере(ТолькоОбязательные = Ложь)
	
	Для Каждого ТекРеквизит Из ЭтотОбъект.ТаблицаДопРеквизитов Цикл
		Если НЕ ТолькоОбязательные ИЛИ ТекРеквизит.Реквизит.ЗаполнятьОбязательно Тогда
			ОписаниеТипа = Новый ОписаниеТипов(ТекРеквизит.Реквизит.ТипЗначения);
			
			НоваяСтрока = Объект.ор_ДополнительныеРеквизиты.Добавить();
			НоваяСтрока.Реквизит      = ТекРеквизит.Реквизит;
			НоваяСтрока.Представление = ТекРеквизит.Реквизит;
			НоваяСтрока.Тип           = ТекРеквизит.Тип;
			НоваяСтрока.Значение      = ОписаниеТипа.ПривестиЗначение();
			Если ТипЗнч(НоваяСтрока.Значение) = Тип("Строка") Тогда
				НоваяСтрока.Значение = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуДопРеквизитов(НачальныеПараметры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НаборДополнительныхРеквизитов.Свойство.Заголовок КАК Заголовок,
	|	НаборДополнительныхРеквизитов.Свойство КАК Свойство,
	|	НаборДополнительныхРеквизитов.Свойство.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборДополнительныхРеквизитов
	|ГДЕ
	|	НаборДополнительныхРеквизитов.Ссылка = &НаборСвойств";
	Запрос.УстановитьПараметр("НаборСвойств", НаборСвойств);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.ТаблицаДопРеквизитов.Добавить();
		НоваяСтрока.Синоним  = Выборка.Заголовок;
		НоваяСтрока.Реквизит = Выборка.Свойство;
		НоваяСтрока.Тип      = Выборка.ТипЗначения;
		ЭтотОбъект.СписокДопРеквизитов.Добавить(Выборка.Свойство);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокРеквизитов(НачальныеПараметры)
	
	Для Каждого Реквизит Из НачальныеПараметры.НаборРеквизитов Цикл
		
		Если НЕ ШаблоныНаименований.ОтраслевойРеквизитИспользуется(Реквизит.Имя, Объект.ВидНаименования) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ШаблоныНаименований.РеквизитИспользуется(Реквизит.Имя, Истина) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтотОбъект.ИсключающиеРеквизиты.НайтиПоЗначению(Реквизит.Синоним) = Неопределено Тогда
			ЭтотОбъект.СписокРеквизитовФормы.Добавить(Реквизит.Синоним);
		КонецЕсли;
	КонецЦикла;
	
Конецпроцедуры

&НаСервере
// Процедура формирует таблицу реквизитов
//
Функция СформироватьТаблицуРеквизитов(НачальныеПараметры)
	
	ТаблицаРеквизитовВременная = Новый ТаблицаЗначений;
	ТаблицаРеквизитовВременная.Колонки.Добавить("Синоним");
	ТаблицаРеквизитовВременная.Колонки.Добавить("Тип");
	ТаблицаРеквизитовВременная.Колонки.Добавить("Реквизит");
	
	Для Каждого Реквизит Из НачальныеПараметры.НаборРеквизитов Цикл
		
		Если НЕ ШаблоныНаименований.ОтраслевойРеквизитИспользуется(Реквизит.Имя, Объект.ВидНаименования) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ШаблоныНаименований.РеквизитИспользуется(Реквизит.Имя, Истина) Тогда
			Продолжить;
		КонецЕсли;
		
		// Добавляем только те реквизиты, которые не входят в исключения
		Если ЭтотОбъект.ИсключающиеРеквизиты.НайтиПоЗначению(Реквизит.Синоним) = Неопределено Тогда
			НоваяСтрока = ТаблицаРеквизитовВременная.Добавить();
			НоваяСтрока.Синоним  = Реквизит.Синоним;
			НоваяСтрока.Тип      = Реквизит.Тип;
			НоваяСтрока.Реквизит = Реквизит.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРеквизитовВременная;
	
КонецФункции

&НаКлиенте
// Возвращает строки реквизита
//
Функция ПолучитьПараметрыСтрокиРеквизита(ВыбранноеЗначение)
	
	СтруктураОтбора = Новый Структура("Синоним", ВыбранноеЗначение);
	СтрокиПоиска = ЭтотОбъект.ТаблицаРеквизитов.НайтиСтроки(СтруктураОтбора);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Тип", СтрокиПоиска[0].Тип);
	СтруктураПараметров.Вставить("Синоним", СтрокиПоиска[0].Синоним);
	СтруктураПараметров.Вставить("Реквизит", СтрокиПоиска[0].Реквизит);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
// Возвращает строки дополнительного реквизита
//
Функция ПолучитьПараметрыСтрокиДопРеквизита(ВыбранноеЗначение)
	
	СтруктураОтбора = Новый Структура("Реквизит", ВыбранноеЗначение);
	СтрокиПоиска = ЭтотОбъект.ТаблицаДопРеквизитов.НайтиСтроки(СтруктураОтбора);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Тип", СтрокиПоиска[0].Тип);
	СтруктураПараметров.Вставить("Синоним", СтрокиПоиска[0].Синоним);
	СтруктураПараметров.Вставить("Реквизит", СтрокиПоиска[0].Реквизит);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура СформироватьСписокИсключающихРеквизитов()
	
	ЭтотОбъект.ИсключающиеРеквизиты.Добавить("Тип");
	ЭтотОбъект.ИсключающиеРеквизиты.Добавить("Категория");
	ЭтотОбъект.ИсключающиеРеквизиты.Добавить("Файл картинки");
	ЭтотОбъект.ИсключающиеРеквизиты.Добавить("Наименование полное");
	ЭтотОбъект.ИсключающиеРеквизиты.Добавить("Наименование поставщика");
	ЭтотОбъект.ИсключающиеРеквизиты.Добавить("Вставка");
	
Конецпроцедуры

&НаКлиенте
// Заполняет реквизиты по умолчанию
//
Процедура ЗаполнитьРеквизитыПоУмолчаниюЗавершение(Результат, ТолькоОбязательные = Ложь) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ор_РеквизитыДляЗаполнения.Очистить();
	КонецЕсли;
	
	ЗаполнитьРеквизитыПоУмолчаниюНаСервере(ТолькоОбязательные);
	
КонецПроцедуры

&НаКлиенте
// Заполняет дополнительные реквизиты по умолчанию
//
Процедура ЗаполнитьДополнительныеРеквизитыПоУмолчаниюЗавершение(Результат, ТолькоОбязательные = Ложь) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ор_ДополнительныеРеквизиты.Очистить();
	КонецЕсли;
	
	ЗаполнитьДополнительныеРеквизитыНаСервере(ТолькоОбязательные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеТовараВнеБазыЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ор_ДополнительныеРеквизиты.Очистить();
		Объект.ор_РеквизитыДляЗаполнения.Очистить();
		УстановнитьВидимостьРеквизитовПравила();
	Иначе
		Объект.ор_ТоварВнеБазы = Не Объект.ор_ТоварВнеБазы;
		Если Не Объект.ор_ТоварВнеБазы Тогда
			ИмяПараметра = "[ор_НаименованиеПоставщика]";
			УдалитьПараметрИзШаблона(Объект.ШаблонДляПредставления, ИмяПараметра);
			УдалитьПараметрИзШаблона(Объект.ШаблонДляФормирования, ИмяПараметра);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
